TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_epwmxbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the OUT1MUXENABLE32TO64 register
//
//*************************************************************************************************
#define XBAR_OUT1MUXENABLE32TO64_MUX32   0x1U          // MUX32 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX33   0x2U          // MUX33 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX34   0x4U          // MUX34 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX35   0x8U          // MUX35 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX36   0x10U         // MUX36 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX37   0x20U         // MUX37 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX38   0x40U         // MUX38 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX39   0x80U         // MUX39 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX40   0x100U        // MUX40 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX41   0x200U        // MUX41 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX42   0x400U        // MUX42 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX43   0x800U        // MUX43 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX44   0x1000U       // MUX44 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX45   0x2000U       // MUX45 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX46   0x4000U       // MUX46 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX47   0x8000U       // MUX47 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX48   0x10000U      // MUX48 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX49   0x20000U      // MUX49 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX50   0x40000U      // MUX50 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX51   0x80000U      // MUX51 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX52   0x100000U     // MUX52 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX53   0x200000U     // MUX53 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX54   0x400000U     // MUX54 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX55   0x800000U     // MUX55 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX56   0x1000000U    // MUX56 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX57   0x2000000U    // MUX57 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX58   0x4000000U    // MUX58 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX59   0x8000000U    // MUX59 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX60   0x10000000U   // MUX60 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX61   0x20000000U   // MUX61 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX62   0x40000000U   // MUX62 to drive OUT1 of EPWM-XBAR
#define XBAR_OUT1MUXENABLE32TO64_MUX63   0x80000000U   // MUX63 to drive OUT1 of EPWM-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUT2MUXENABLE register
//
//*************************************************************************************************
#define XBAR_OUT2MUXENABLE_MUX0    0x1U          // MUX0 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX1    0x2U          // MUX1 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX2    0x4U          // MUX2 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX3    0x8U          // MUX3 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX4    0x10U         // MUX4 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX5    0x20U         // MUX5 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX6    0x40U         // MUX6 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX7    0x80U         // MUX7 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX8    0x100U        // MUX8 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX9    0x200U        // MUX9 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX10   0x400U        // MUX10 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX11   0x800U        // MUX11 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX12   0x1000U       // MUX12 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX13   0x2000U       // MUX13 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX14   0x4000U       // MUX14 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX15   0x8000U       // MUX15 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX16   0x10000U      // MUX16 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX17   0x20000U      // MUX17 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX18   0x40000U      // MUX18 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX19   0x80000U      // MUX19 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX20   0x100000U     // MUX20 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX21   0x200000U     // MUX21 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX22   0x400000U     // MUX22 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX23   0x800000U     // MUX23 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX24   0x1000000U    // MUX24 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX25   0x2000000U    // MUX25 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX26   0x4000000U    // MUX26 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX27   0x8000000U    // MUX27 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX28   0x10000000U   // MUX28 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX29   0x20000000U   // MUX29 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX30   0x40000000U   // MUX30 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE_MUX31   0x80000000U   // MUX31 to drive OUT2 of EPWM-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUT2MUXENABLE32TO64 register
//
//*************************************************************************************************
#define XBAR_OUT2MUXENABLE32TO64_MUX32   0x1U          // MUX32 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX33   0x2U          // MUX33 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX34   0x4U          // MUX34 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX35   0x8U          // MUX35 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX36   0x10U         // MUX36 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX37   0x20U         // MUX37 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX38   0x40U         // MUX38 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX39   0x80U         // MUX39 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX40   0x100U        // MUX40 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX41   0x200U        // MUX41 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX42   0x400U        // MUX42 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX43   0x800U        // MUX43 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX44   0x1000U       // MUX44 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX45   0x2000U       // MUX45 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX46   0x4000U       // MUX46 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX47   0x8000U       // MUX47 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX48   0x10000U      // MUX48 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX49   0x20000U      // MUX49 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX50   0x40000U      // MUX50 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX51   0x80000U      // MUX51 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX52   0x100000U     // MUX52 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX53   0x200000U     // MUX53 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX54   0x400000U     // MUX54 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX55   0x800000U     // MUX55 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX56   0x1000000U    // MUX56 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX57   0x2000000U    // MUX57 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX58   0x4000000U    // MUX58 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX59   0x8000000U    // MUX59 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX60   0x10000000U   // MUX60 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX61   0x20000000U   // MUX61 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX62   0x40000000U   // MUX62 to drive OUT2 of EPWM-XBAR
#define XBAR_OUT2MUXENABLE32TO64_MUX63   0x80000000U   // MUX63 to drive OUT2 of EPWM-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUT3MUXENABLE register
//
//*************************************************************************************************
#define XBAR_OUT3MUXENABLE_MUX0    0x1U          // MUX0 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX1    0x2U          // MUX1 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX2    0x4U          // MUX2 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX3    0x8U          // MUX3 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX4    0x10U         // MUX4 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX5    0x20U         // MUX5 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX6    0x40U         // MUX6 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX7    0x80U         // MUX7 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX8    0x100U        // MUX8 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX9    0x200U        // MUX9 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX10   0x400U        // MUX10 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX11   0x800U        // MUX11 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX12   0x1000U       // MUX12 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX13   0x2000U       // MUX13 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX14   0x4000U       // MUX14 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX15   0x8000U       // MUX15 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX16   0x10000U      // MUX16 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX17   0x20000U      // MUX17 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX18   0x40000U      // MUX18 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX19   0x80000U      // MUX19 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX20   0x100000U     // MUX20 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX21   0x200000U     // MUX21 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX22   0x400000U     // MUX22 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX23   0x800000U     // MUX23 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX24   0x1000000U    // MUX24 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX25   0x2000000U    // MUX25 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX26   0x4000000U    // MUX26 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX27   0x8000000U    // MUX27 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX28   0x10000000U   // MUX28 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX29   0x20000000U   // MUX29 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX30   0x40000000U   // MUX30 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE_MUX31   0x80000000U   // MUX31 to drive OUT3 of EPWM-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUT3MUXENABLE32TO64 register
//
//*************************************************************************************************
#define XBAR_OUT3MUXENABLE32TO64_MUX32   0x1U          // MUX32 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX33   0x2U          // MUX33 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX34   0x4U          // MUX34 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX35   0x8U          // MUX35 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX36   0x10U         // MUX36 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX37   0x20U         // MUX37 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX38   0x40U         // MUX38 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX39   0x80U         // MUX39 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX40   0x100U        // MUX40 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX41   0x200U        // MUX41 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX42   0x400U        // MUX42 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX43   0x800U        // MUX43 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX44   0x1000U       // MUX44 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX45   0x2000U       // MUX45 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX46   0x4000U       // MUX46 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX47   0x8000U       // MUX47 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX48   0x10000U      // MUX48 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX49   0x20000U      // MUX49 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX50   0x40000U      // MUX50 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX51   0x80000U      // MUX51 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX52   0x100000U     // MUX52 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX53   0x200000U     // MUX53 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX54   0x400000U     // MUX54 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX55   0x800000U     // MUX55 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX56   0x1000000U    // MUX56 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX57   0x2000000U    // MUX57 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX58   0x4000000U    // MUX58 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX59   0x8000000U    // MUX59 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX60   0x10000000U   // MUX60 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX61   0x20000000U   // MUX61 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX62   0x40000000U   // MUX62 to drive OUT3 of EPWM-XBAR
#define XBAR_OUT3MUXENABLE32TO64_MUX63   0x80000000U   // MUX63 to drive OUT3 of EPWM-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUT4MUXENABLE register
//
//*************************************************************************************************
#define XBAR_OUT4MUXENABLE_MUX0    0x1U          // MUX0 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX1    0x2U          // MUX1 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX2    0x4U          // MUX2 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX3    0x8U          // MUX3 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX4    0x10U         // MUX4 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX5    0x20U         // MUX5 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX6    0x40U         // MUX6 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX7    0x80U         // MUX7 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX8    0x100U        // MUX8 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX9    0x200U        // MUX9 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX10   0x400U        // MUX10 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX11   0x800U        // MUX11 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX12   0x1000U       // MUX12 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX13   0x2000U       // MUX13 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX14   0x4000U       // MUX14 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX15   0x8000U       // MUX15 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX16   0x10000U      // MUX16 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX17   0x20000U      // MUX17 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX18   0x40000U      // MUX18 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX19   0x80000U      // MUX19 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX20   0x100000U     // MUX20 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX21   0x200000U     // MUX21 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX22   0x400000U     // MUX22 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX23   0x800000U     // MUX23 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX24   0x1000000U    // MUX24 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX25   0x2000000U    // MUX25 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX26   0x4000000U    // MUX26 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX27   0x8000000U    // MUX27 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX28   0x10000000U   // MUX28 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX29   0x20000000U   // MUX29 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX30   0x40000000U   // MUX30 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE_MUX31   0x80000000U   // MUX31 to drive OUT4 of EPWM-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUT4MUXENABLE32TO64 register
//
//*************************************************************************************************
#define XBAR_OUT4MUXENABLE32TO64_MUX32   0x1U          // MUX32 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX33   0x2U          // MUX33 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX34   0x4U          // MUX34 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX35   0x8U          // MUX35 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX36   0x10U         // MUX36 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX37   0x20U         // MUX37 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX38   0x40U         // MUX38 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX39   0x80U         // MUX39 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX40   0x100U        // MUX40 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX41   0x200U        // MUX41 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX42   0x400U        // MUX42 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX43   0x800U        // MUX43 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX44   0x1000U       // MUX44 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX45   0x2000U       // MUX45 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX46   0x4000U       // MUX46 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX47   0x8000U       // MUX47 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX48   0x10000U      // MUX48 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX49   0x20000U      // MUX49 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX50   0x40000U      // MUX50 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX51   0x80000U      // MUX51 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX52   0x100000U     // MUX52 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX53   0x200000U     // MUX53 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX54   0x400000U     // MUX54 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX55   0x800000U     // MUX55 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX56   0x1000000U    // MUX56 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX57   0x2000000U    // MUX57 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX58   0x4000000U    // MUX58 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX59   0x8000000U    // MUX59 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX60   0x10000000U   // MUX60 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX61   0x20000000U   // MUX61 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX62   0x40000000U   // MUX62 to drive OUT4 of EPWM-XBAR
#define XBAR_OUT4MUXENABLE32TO64_MUX63   0x80000000U   // MUX63 to drive OUT4 of EPWM-XBAR

